Revit 2026 API

# SelectionFailures Properties

---

The BuiltInFailuresSelectionFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | NoElementSelected | No element selected. |
|  | NoValidElementSelected | No valid element selected. |

#### Reference

BuiltInFailuresSelectionFailures Class

Autodesk.Revit.DB Namespace